bkempers/baremetal-rtos/HAL/src/stm32h7rs_hal_usart.c
#include "stm32h7rs_hal_usart.h"
#include "stm32h7rs_hal.h"
#include "stm32h7rs_hal_rcc.h"
#include "stm32h7rsxx.h"
#include "stm32h7s3xx.h"

#define USART_TX_RX_TIMEOUT 1000U

/*
 * CR1_M - M0/M1 word length
 * CR1_PCE - Parity control enable
 * CR1_PS - Parity selection
 * CR1_TE - Transmitter enable
 * CR1_RC - Receiver enable
 * CR1_OVER8 - Oversamping by 8-bit
 */
#define USART_CR1_CLEARMASK                                                                                                                          \
    ((uint32_t) (USART_CR1_M | USART_CR1_PCE | USART_CR1_PS | USART_CR1_TE | USART_CR1_RE | USART_CR1_OVER8 | USART_CR1_FIFOEN))

/*
 * CR2_CPHA - Clock phase
 * CR2_CPOL - Clock polarity
 * CR2_CLKEN - Clock enable
 * CR2_LBCL - Last clock bit pulse
 * CR2_STOP - Stop bits
 * CR2_SLVEN - Synchronous slave mode enable
 * CR2_DIS_NSS - NSS pin input is ignored
 */
#define USART_CR2_CLEARMASK                                                                                                                          \
    ((uint32_t) (USART_CR2_CPHA | USART_CR2_CPOL | USART_CR2_CLKEN | USART_CR2_LBCL | USART_CR2_STOP | USART_CR2_SLVEN | USART_CR2_DIS_NSS))

static HAL_Status      usart_set_baudrate(USART_TypeDef *USARTx, uint32_t BaudRate);
static inline uint32_t usart_get_clock_source(USART_TypeDef *USARTx);
static uint32_t        usart_get_clock_freq(USART_ClockSource clock_source);
static HAL_Status      usart_set_config(USART_Handle *handle);
static HAL_Status      usart_check_idle(USART_Handle *handle);
static HAL_Status      usart_check_flag(USART_Handle *handle, USART_Flag flag, FlagStatus status, uint32_t tickstart, uint32_t timeout);
static void            usart_end_transfer(USART_Handle *handle);
static void            usart_end_transmit_it(USART_Handle *handle);

static void USART_TxISR_8FIFO(USART_Handle *handle);
static void USART_TxISR_8(USART_Handle *handle);

static void USART_RxISR_8FIFO(USART_Handle *handle);
static void USART_RxISR_8(USART_Handle *handle);

HAL_Status HAL_USART_Init(USART_Handle *handle)
{
    if (handle == NULL) {
        return HAL_ERROR;
    }

    if (handle->State == HAL_USART_STATE_RESET) {
        handle->Lock = HAL_LOCKED;
    }

    handle->State = HAL_USART_STATE_BUSY;

    // DISABLE USART
    handle->Instance->CR1 &= ~USART_CR1_UE;

    if (usart_set_config(handle) == HAL_ERROR) {
        return HAL_ERROR;
    }

    /* In Synchronous SPI mode, the following bits must be kept cleared:
    - LINEN bit in the USART_CR2 register
    - HDSEL, SCEN and IREN bits in the USART_CR3 register.
    */
    handle->Instance->CR2 &= ~USART_CR2_LINEN;
    handle->Instance->CR3 &= ~(USART_CR3_SCEN | USART_CR3_HDSEL | USART_CR3_IREN);

    // ENABLE USART
    handle->Instance->CR1 |= USART_CR1_UE;

    return usart_check_idle(handle);
}

HAL_Status HAL_USART_DeInit(USART_Handle *handle)
{
    // TODO: add later
    return HAL_OK;
}

HAL_Status HAL_USART_Receive(USART_Handle *handle, uint8_t *rxPointer, uint16_t size, uint32_t timeout)
{
    uint8_t *rx_data_8b;
    uint16_t uhMask;
    uint32_t tickstart;

    if (handle->State == HAL_USART_STATE_READY) {
        if ((rxPointer == NULL) || (size == 0U)) {
            return HAL_ERROR;
        }

        handle->errorCode = USART_ERROR_NONE;
        handle->State     = HAL_USART_STATE_BUSY_RX;

        /* Init tickstart for timeout management */
        tickstart = HAL_GetTick();

        handle->rxSize  = size;
        handle->rxCount = size;

        /* Computation of USART mask to apply to RDR register */
        // USART_MASK_COMPUTATION(handle);
        // uhMask = handle->Mask;
        rx_data_8b = (uint8_t *) rxPointer;

        /* as long as data have to be received */
        while (handle->rxCount > 0U) {
            if (usart_check_flag(handle, USART_FLAG_RXNE, RESET, tickstart, timeout) != HAL_OK) {
                return HAL_TIMEOUT;
            }
            *rx_data_8b = (uint8_t) (handle->Instance->RDR & (uint8_t) (uhMask & 0xFFU));
            rx_data_8b++;

            handle->rxCount--;
        }

        handle->State = HAL_USART_STATE_READY;

        return HAL_OK;
    } else {
        return HAL_BUSY;
    }
}

HAL_Status HAL_USART_Transmit(USART_Handle *handle, const uint8_t *txPointer, uint16_t size, uint32_t timeout)
{
    const uint8_t *tx_data_8b;
    uint32_t       tickstart;

    if (handle->State == HAL_USART_STATE_READY) {
        if ((txPointer == NULL) || (size == 0U)) {
            return HAL_ERROR;
        }

        handle->errorCode = USART_ERROR_NONE;
        handle->State     = HAL_USART_STATE_BUSY_TX;

        /* Init tickstart for timeout management */
        tickstart = HAL_GetTick();

        handle->txSize  = size;
        handle->txCount = size;

        tx_data_8b = txPointer;

        while (handle->txCount > 0U) {
            if (usart_check_flag(handle, USART_FLAG_TXE, SET, tickstart, timeout) != HAL_OK) {
                return HAL_TIMEOUT;
            }
            handle->Instance->TDR = (uint8_t) (*tx_data_8b & 0xFFU);

            tx_data_8b++;
            handle->txCount--;
        }

        if (usart_check_flag(handle, USART_FLAG_TC, SET, tickstart, timeout) != HAL_OK) {
            return HAL_TIMEOUT;
        }

        handle->Instance->ICR = (uint32_t) USART_CLEAR_TCF;
        handle->Instance->ICR = (uint32_t) USART_CLEAR_OREF;

        handle->Instance->RQR |= (uint16_t) USART_RQR_RXFRQ;
        handle->Instance->RQR |= (uint16_t) USART_RQR_TXFRQ;

        handle->State = HAL_USART_STATE_READY;
        return HAL_OK;
    } else {
        return HAL_BUSY;
    }
}

HAL_Status HAL_USART_Receiver_IT(USART_Handle *handle, uint8_t *rxPointer, uint16_t size)
{
    uint16_t nb_dummy_data;

    if (handle->State == HAL_USART_STATE_READY) {
        if ((rxPointer == NULL) || (size == 0U)) {
            return HAL_ERROR;
        }

        handle->rxPointer = rxPointer;
        handle->rxSize    = size;
        handle->rxCount   = size;
        handle->RxISR     = NULL;

        handle->errorCode = USART_ERROR_NONE;
        handle->State     = HAL_USART_STATE_BUSY_RX;

