bkempers/baremetal-rtos/HAL/src/stm32h7rs_hal_usart.c
        /* Enable the USART Error Interrupt: (Frame error, noise error, overrun error) */
        SET_BIT(handle->Instance->CR3, USART_CR3_EIE);

        /* Configure Rx interrupt processing */
        if ((handle->fifoMode == USART_CR1_FIFOEN) && (size >= handle->rxProcessData)) {
            /* Set the Rx ISR function pointer according to the data word length */
            if ((handle->Init.WordLen == USART_WORDLENGTH_9B) && (handle->Init.Parity == USART_PARITY_NONE)) {
                // TODO: not supported
            } else {
                handle->RxISR = USART_RxISR_8FIFO;
            }

            /* Enable the USART Parity Error interrupt and RX FIFO Threshold interrupt */
            if (handle->Init.Parity != USART_PARITY_NONE) {
                SET_BIT(handle->Instance->CR1, USART_CR1_PEIE);
            }
            SET_BIT(handle->Instance->CR3, USART_CR3_RXFTIE);
        } else {
            /* Set the Rx ISR function pointer according to the data word length */
            if ((handle->Init.WordLen == USART_WORDLENGTH_9B) && (handle->Init.Parity == USART_PARITY_NONE)) {
                // TODO: not supported
            } else {
                handle->RxISR = USART_RxISR_8;
            }

            /* Enable the USART Parity Error and Data Register not empty Interrupts */
            if (handle->Init.Parity != USART_PARITY_NONE) {
                SET_BIT(handle->Instance->CR1, USART_CR1_PEIE | USART_CR1_RXNEIE_RXFNEIE);
            } else {
                SET_BIT(handle->Instance->CR1, USART_CR1_RXNEIE_RXFNEIE);
            }
        }

        return HAL_OK;
    } else {
        return HAL_BUSY;
    }
}

HAL_Status HAL_USART_Transmit_IT(USART_Handle *handle, const uint8_t *txPointer, uint16_t size)
{
    if (handle->State == HAL_USART_STATE_READY) {
        if ((txPointer == NULL) || (size == 0U)) {
            return HAL_ERROR;
        }

        handle->txPointer = txPointer;
        handle->txSize    = size;
        handle->txCount   = size;
        handle->TxISR     = NULL;

        handle->errorCode = USART_ERROR_NONE;
        handle->State     = HAL_USART_STATE_BUSY_TX;

        /* The USART Error Interrupts: (Frame error, noise error, overrun error)
        are not managed by the USART Transmit Process to avoid the overrun interrupt
        when the usart mode is configured for transmit and receive "USART_MODE_TX_RX"
        to benefit for the frame error and noise interrupts the usart mode should be
        configured only for transmit "USART_MODE_TX" */

        /* Configure Tx interrupt processing */
        if (handle->fifoMode == USART_CR1_FIFOEN) {
            /* Set the Tx ISR function pointer according to the data word length */
            if ((handle->Init.WordLen == USART_WORDLENGTH_9B) && (handle->Init.Parity == USART_PARITY_NONE)) {
                // TODO: not supported
            } else {
                handle->TxISR = USART_TxISR_8FIFO;
            }

            /* Enable the TX FIFO threshold interrupt */
            usart_enable_interrupt(handle, USART_IT_TXFT);
        } else {
            /* Set the Tx ISR function pointer according to the data word length */
            if ((handle->Init.WordLen == USART_WORDLENGTH_9B) && (handle->Init.Parity == USART_PARITY_NONE)) {
                // TODO: not supported
            } else {
                handle->TxISR = USART_TxISR_8;
            }

            /* Enable the USART Transmit Data Register Empty Interrupt */
            usart_enable_interrupt(handle, USART_IT_TXE);
        }

        return HAL_OK;
    } else {
        return HAL_BUSY;
    }
}

HAL_Status HAL_USART_Receive_Transmit_IT(USART_Handle *handle, uint8_t *rxPointer, const uint8_t *txPointer, uint16_t size)
{
    if (handle->State == HAL_USART_STATE_READY) {
        if ((txPointer == NULL) || (rxPointer == NULL) || (size == 0U)) {
            return HAL_ERROR;
        }

        handle->rxPointer = rxPointer;
        handle->rxSize    = size;
        handle->rxCount   = size;
        handle->txPointer = txPointer;
        handle->txSize    = size;
        handle->txCount   = size;

        handle->errorCode = USART_ERROR_NONE;
        handle->State     = HAL_USART_STATE_BUSY_TX_RX;

        /* Configure TxRx interrupt processing */
        if ((handle->fifoMode == USART_CR1_FIFOEN) && (size >= handle->rxProcessData)) {
            /* Set the Rx ISR function pointer according to the data word length */
            if ((handle->Init.WordLen == USART_WORDLENGTH_9B) && (handle->Init.Parity == USART_PARITY_NONE)) {
                // TODO: not supported
            } else {
                handle->TxISR = USART_TxISR_8FIFO;
                handle->RxISR = USART_RxISR_8FIFO;
            }

            /* Enable the USART Error Interrupt: (Frame error, noise error, overrun error) */
            SET_BIT(handle->Instance->CR3, USART_CR3_EIE);

            if (handle->Init.Parity != USART_PARITY_NONE) {
                /* Enable the USART Parity Error interrupt  */
                SET_BIT(handle->Instance->CR1, USART_CR1_PEIE);
            }

            /* Enable the TX and  RX FIFO Threshold interrupts */
            SET_BIT(handle->Instance->CR3, (USART_CR3_TXFTIE | USART_CR3_RXFTIE));
        } else {
            if ((handle->Init.WordLen == USART_WORDLENGTH_9B) && (handle->Init.Parity == USART_PARITY_NONE)) {
                // TODO: not supported
            } else {
                handle->TxISR = USART_TxISR_8;
                handle->RxISR = USART_RxISR_8;
            }

            /* Enable the USART Error Interrupt: (Frame error, noise error, overrun error) */
            SET_BIT(handle->Instance->CR3, USART_CR3_EIE);

            /* Enable the USART Parity Error and USART Data Register not empty Interrupts */
            if (handle->Init.Parity != USART_PARITY_NONE) {
                SET_BIT(handle->Instance->CR1, USART_CR1_PEIE | USART_CR1_RXNEIE_RXFNEIE);
            } else {
                SET_BIT(handle->Instance->CR1, USART_CR1_RXNEIE_RXFNEIE);
            }

            /* Enable the USART Transmit Data Register Empty Interrupt */
            SET_BIT(handle->Instance->CR1, USART_CR1_TXEIE_TXFNFIE);
        }

        return HAL_OK;
    } else {
        return HAL_BUSY;
    }
}

HAL_Status HAL_USART_Abort(USART_Handle *handle)
{
    // TODO: add in later
    return HAL_OK;
}

HAL_Status HAL_USART_Abort_IT(USART_Handle *handle)
{
    // TODO: add in later
    return HAL_OK;
}

