bkempers/baremetal-rtos/HAL/src/stm32h7rs_hal_usart.c
void HAL_USART_IRQHandler(USART_Handle *handle)
{
    uint32_t isrflags = READ_REG(handle->Instance->ISR);
    uint32_t cr1its   = READ_REG(handle->Instance->CR1);
    uint32_t cr3its   = READ_REG(handle->Instance->CR3);

    uint32_t errorflags;
    uint32_t errorcode;

    /* If no error occurs */
    errorflags = (isrflags & (uint32_t) (USART_ISR_PE | USART_ISR_FE | USART_ISR_ORE | USART_ISR_NE | USART_ISR_RTOF | USART_ISR_UDR));
    if (errorflags == 0U) {
        /* USART in mode Receiver ---------------------------------------------------*/
        if (((isrflags & USART_ISR_RXNE_RXFNE) != 0U) && (((cr1its & USART_CR1_RXNEIE_RXFNEIE) != 0U) || ((cr3its & USART_CR3_RXFTIE) != 0U))) {
            if (handle->RxISR != NULL) {
                handle->RxISR(handle);
            }
            return;
        }
    }

    /* If some errors occur */
    if ((errorflags != 0U) &&
        (((cr3its & (USART_CR3_RXFTIE | USART_CR3_EIE)) != 0U) || ((cr1its & (USART_CR1_RXNEIE_RXFNEIE | USART_CR1_PEIE)) != 0U))) {
        /* USART parity error interrupt occurred -------------------------------------*/
        if (((isrflags & USART_ISR_PE) != 0U) && ((cr1its & USART_CR1_PEIE) != 0U)) {
            handle->Instance->ICR = (uint32_t) USART_CLEAR_PEF;
            handle->errorCode |= USART_ERROR_PE;
        }

        /* USART frame error interrupt occurred --------------------------------------*/
        if (((isrflags & USART_ISR_FE) != 0U) && ((cr3its & USART_CR3_EIE) != 0U)) {
            handle->Instance->ICR = (uint32_t) USART_CLEAR_FEF;
            handle->errorCode |= USART_ERROR_FE;
        }

        /* USART noise error interrupt occurred --------------------------------------*/
        if (((isrflags & USART_ISR_NE) != 0U) && ((cr3its & USART_CR3_EIE) != 0U)) {
            handle->Instance->ICR = (uint32_t) USART_CLEAR_NEF;
            handle->errorCode |= USART_ERROR_NE;
        }

        /* USART Over-Run interrupt occurred -----------------------------------------*/
        if (((isrflags & USART_ISR_ORE) != 0U) &&
            (((cr1its & USART_CR1_RXNEIE_RXFNEIE) != 0U) || ((cr3its & (USART_CR3_RXFTIE | USART_CR3_EIE)) != 0U))) {
            handle->Instance->ICR = (uint32_t) USART_CLEAR_OREF;
            handle->errorCode |= USART_ERROR_ORE;
        }

        /* USART Receiver Timeout interrupt occurred ---------------------------------*/
        if (((isrflags & USART_ISR_RTOF) != 0U) && ((cr1its & USART_CR1_RTOIE) != 0U)) {
            handle->Instance->ICR = (uint32_t) USART_CLEAR_RTOF;
            handle->errorCode |= USART_ERROR_RTO;
        }

        /* USART SPI slave underrun error interrupt occurred -------------------------*/
        if (((isrflags & USART_ISR_UDR) != 0U) && ((cr3its & USART_CR3_EIE) != 0U)) {
            /* Ignore SPI slave underrun errors when reception is going on */
            if (handle->State == HAL_USART_STATE_BUSY_RX) {
                handle->Instance->ICR = USART_CLEAR_UDRF;
                return;
            } else {
                handle->Instance->ICR = USART_CLEAR_UDRF;
                handle->errorCode |= USART_ERROR_UDR;
            }
        }

        /* Call USART Error Call back function if need be --------------------------*/
        if (handle->errorCode != USART_ERROR_NONE) {
            /* USART in mode Receiver ---------------------------------------------------*/
            if (((isrflags & USART_ISR_RXNE_RXFNE) != 0U) && (((cr1its & USART_CR1_RXNEIE_RXFNEIE) != 0U) || ((cr3its & USART_CR3_RXFTIE) != 0U))) {
                if (handle->RxISR != NULL) {
                    handle->RxISR(handle);
                }
            }

            /* If Overrun error occurs, or if any error occurs in DMA mode reception,
               consider error as blocking */
            errorcode = handle->errorCode & USART_ERROR_ORE;
            if ((HAL_IS_BIT_SET(handle->Instance->CR3, USART_CR3_DMAR)) || (errorcode != 0U)) {
                /* Blocking error : transfer is aborted
                   Set the USART state ready to be able to start again the process,
                   Disable Interrupts, and disable DMA requests, if ongoing */
                usart_end_transfer(handle);

                /* Call registered Error Callback */
                handle->errorCallback(handle);
            } else {
                /* Non Blocking error : transfer could go on.
                   Error is notified to user through user error callback */
                /* Call registered Error Callback */
                handle->errorCallback(handle);
                handle->errorCode = USART_ERROR_NONE;
            }
        }
        return;

    } /* End if some error occurs */

    /* USART in mode Transmitter ------------------------------------------------*/
    if (((isrflags & USART_ISR_TXE_TXFNF) != 0U) && (((cr1its & USART_CR1_TXEIE_TXFNFIE) != 0U) || ((cr3its & USART_CR3_TXFTIE) != 0U))) {
        if (handle->TxISR != NULL) {
            handle->TxISR(handle);
        }
        return;
    }

    /* USART in mode Transmitter (transmission end) -----------------------------*/
    if (((isrflags & USART_ISR_TC) != 0U) && ((cr1its & USART_CR1_TCIE) != 0U)) {
        usart_end_transmit_it(handle);
        return;
    }

    /* USART TX Fifo Empty occurred ----------------------------------------------*/
    if (((isrflags & USART_ISR_TXFE) != 0U) && ((cr1its & USART_CR1_TXFEIE) != 0U)) {
        /* Call registered Tx Fifo Empty Callback */
        handle->txFifoEmptyCallback(handle);
        return;
    }

    /* USART RX Fifo Full occurred ----------------------------------------------*/
    if (((isrflags & USART_ISR_RXFF) != 0U) && ((cr1its & USART_CR1_RXFFIE) != 0U)) {
        /* Call registered Rx Fifo Full Callback */
        handle->rxFifoFullCallback(handle);
        return;
    }
}

__weak void HAL_USART_txHalfCpltCallback(USART_Handle *handle)
{
    UNUSED(handle);
}

__weak void HAL_USART_txCpltCallback(USART_Handle *handle)
{
    UNUSED(handle);
}

__weak void HAL_USART_rxCpltCallback(USART_Handle *handle)
{
    UNUSED(handle);
}

