bkempers/baremetal-rtos/HAL/src/stm32h7rs_hal_usart.c
__weak void HAL_USART_rxHalfCpltCallback(USART_Handle *handle)
{
    UNUSED(handle);
}

__weak void HAL_USART_txrxCpltCallback(USART_Handle *handle)
{
    UNUSED(handle);
}

__weak void HAL_USART_errorCallback(USART_Handle *handle)
{
    UNUSED(handle);
}

__weak void HAL_USART_abortCpltCallback(USART_Handle *handle)
{
    UNUSED(handle);
}

static void usart_end_transfer(USART_Handle *handle)
{
    /* Disable TXEIE, TCIE, RXNE, RXFT, TXFT, PE and ERR (Frame error, noise error, overrun error) interrupts */
    CLEAR_BIT(handle->Instance->CR1, (USART_CR1_RXNEIE_RXFNEIE | USART_CR1_PEIE | USART_CR1_TXEIE_TXFNFIE | USART_CR1_TCIE));
    CLEAR_BIT(handle->Instance->CR3, (USART_CR3_EIE | USART_CR3_RXFTIE | USART_CR3_TXFTIE));

    /* At end of process, restore husart->State to Ready */
    handle->State = HAL_USART_STATE_READY;
}

static void usart_end_transmit_it(USART_Handle *handle)
{
    /* Disable the USART Transmit Complete Interrupt */
    usart_disable_interrupt(handle, USART_IT_TC);

    /* Disable the USART Error Interrupt: (Frame error, noise error, overrun error) */
    usart_disable_interrupt(handle, USART_IT_ERR);

    /* Clear TxISR function pointer */
    handle->TxISR = NULL;

    if (handle->State == HAL_USART_STATE_BUSY_TX) {
        /* Clear overrun flag and discard the received data */
        handle->Instance->ICR = USART_CLEAR_OREF;
        handle->Instance->RQR |= (uint16_t) USART_RQR_RXFRQ;

        /* Tx process is completed, restore husart->State to Ready */
        handle->State = HAL_USART_STATE_READY;

        /* Call registered Tx Complete Callback */
        handle->txCpltCallback(handle);
    } else if (handle->rxCount == 0U) {
        /* TxRx process is completed, restore husart->State to Ready */
        handle->State = HAL_USART_STATE_READY;

        /* Call registered Tx Rx Complete Callback */
        handle->txrxCpltCallback(handle);
    } else {
        /* Nothing to do */
    }
}

static void USART_RxISR_8(USART_Handle *handle)
{
    const HAL_USART_State state = handle->State;
    uint16_t              txdatacount;
    uint16_t              uhMask = handle->mask;
    uint32_t              txftie;

    if ((state == HAL_USART_STATE_BUSY_RX) || (state == HAL_USART_STATE_BUSY_TX_RX)) {
        *handle->rxPointer = (uint8_t) (handle->Instance->RDR & (uint8_t) uhMask);
        handle->rxPointer++;
        handle->rxCount--;

        if (handle->rxCount == 0U) {
            /* Disable the USART Parity Error Interrupt and RXNE interrupt*/
            CLEAR_BIT(handle->Instance->CR1, (USART_CR1_RXNEIE_RXFNEIE | USART_CR1_PEIE));

            /* Disable the USART Error Interrupt: (Frame error, noise error, overrun error) */
            CLEAR_BIT(handle->Instance->CR3, USART_CR3_EIE);

            /* Clear RxISR function pointer */
            handle->RxISR = NULL;

            /* txftie and txdatacount are temporary variables for MISRAC2012-Rule-13.5 */
            txftie      = READ_BIT(handle->Instance->CR3, USART_CR3_TXFTIE);
            txdatacount = handle->txCount;

            if (state == HAL_USART_STATE_BUSY_RX) {
                /* Call register Rx Complete Callback */
                handle->rxCpltCallback(handle);
            } else if ((READ_BIT(handle->Instance->CR1, USART_CR1_TCIE) != USART_CR1_TCIE) && (txftie != USART_CR3_TXFTIE) && (txdatacount == 0U)) {
                /* TxRx process is completed, restore handle->State to Ready */
                handle->State = HAL_USART_STATE_READY;

                /* Call registered Tx Rx Complete Callback */
                handle->txrxCpltCallback(handle);
            } else {
                /* Nothing to do */
            }
        } else {
            /* Nothing to do */
        }
    }
}

static void USART_RxISR_8FIFO(USART_Handle *handle)
{
    HAL_USART_State state = handle->State;
    uint16_t        txdatacount;
    uint16_t        rxdatacount;
    uint16_t        uhMask = handle->mask;
    uint16_t        nb_rx_data;
    uint32_t        txftie;

    /* Check that a Rx process is ongoing */
    if ((state == HAL_USART_STATE_BUSY_RX) || (state == HAL_USART_STATE_BUSY_TX_RX)) {
        for (nb_rx_data = handle->rxProcessData; nb_rx_data > 0U; nb_rx_data--) {
            if (((handle->Instance->ISR & (USART_FLAG_RXFNE)) == (USART_FLAG_RXFNE)) == SET) {
                *handle->rxPointer = (uint8_t) (handle->Instance->RDR & (uint8_t) (uhMask & 0xFFU));
                handle->rxPointer++;
                handle->rxCount--;

                if (handle->txCount == 0U) {
                    /* Disable the USART Parity Error Interrupt */
                    CLEAR_BIT(handle->Instance->CR1, USART_CR1_PEIE);

                    /* Disable the USART Error Interrupt: (Frame error, noise error, overrun error)
                       and RX FIFO Threshold interrupt */
                    CLEAR_BIT(handle->Instance->CR3, (USART_CR3_EIE | USART_CR3_RXFTIE));

                    /* Clear RxISR function pointer */
                    handle->RxISR = NULL;

                    /* txftie and txdatacount are temporary variables for MISRAC2012-Rule-13.5 */
                    txftie      = READ_BIT(handle->Instance->CR3, USART_CR3_TXFTIE);
                    txdatacount = handle->txCount;

                    if (state == HAL_USART_STATE_BUSY_RX) {
                        /* Rx process is completed, restore handle->State to Ready */
                        handle->State = HAL_USART_STATE_READY;
                        state         = HAL_USART_STATE_READY;

                        /* Call registered Rx Complete Callback */
                        handle->rxCpltCallback(handle);
                    } else if ((READ_BIT(handle->Instance->CR1, USART_CR1_TCIE) != USART_CR1_TCIE) && (txftie != USART_CR3_TXFTIE) &&
                               (txdatacount == 0U)) {
                        /* TxRx process is completed, restore handle->State to Ready */
                        handle->State = HAL_USART_STATE_READY;
                        state         = HAL_USART_STATE_READY;

                        /* Call registered Tx Rx Complete Callback */
                        handle->txrxCpltCallback(handle);
                    } else {
                        /* Nothing to do */
                    }
                } else {
                    /* Nothing to do */
                }
            }
        }

        /* When remaining number of bytes to receive is less than the RX FIFO
        threshold, next incoming frames are processed as if FIFO mode was
        disabled (i.e. one interrupt per received frame).
        */
        rxdatacount = handle->rxCount;
        if (((rxdatacount != 0U)) && (rxdatacount < handle->rxProcessData)) {
            /* Disable the USART RXFT interrupt*/
            CLEAR_BIT(handle->Instance->CR3, USART_CR3_RXFTIE);

            /* Update the RxISR function pointer */
            handle->RxISR = USART_RxISR_8;

            /* Enable the USART Data Register Not Empty interrupt */
            SET_BIT(handle->Instance->CR1, USART_CR1_RXNEIE_RXFNEIE);
        }
    } else {
        /* Clear RXNE interrupt flag */
        handle->Instance->RDR |= (uint16_t) USART_RQR_RXFRQ;
    }
}

static void USART_TxISR_8(USART_Handle *handle)
{
    const HAL_USART_State state = handle->State;

