bkempers/baremetal-rtos/HAL/src/stm32h7rs_hal_usart.c
    /* Check that a Tx process is ongoing */
    if ((state == HAL_USART_STATE_BUSY_TX) || (state == HAL_USART_STATE_BUSY_TX_RX)) {
        if (handle->txCount == 0U) {
            /* Disable the USART Transmit data register empty interrupt */
            usart_disable_interrupt(handle, USART_IT_TXE);

            /* Enable the USART Transmit Complete Interrupt */
            usart_enable_interrupt(handle, USART_IT_TC);
        } else {
            handle->Instance->TDR = (uint8_t) (*handle->txPointer & (uint8_t) 0xFF);
            handle->txPointer++;
            handle->txCount--;
        }
    }
}

static void USART_TxISR_8FIFO(USART_Handle *handle)
{
    const HAL_USART_State state = handle->State;
    uint16_t              nb_tx_data;

    /* Check that a Tx process is ongoing */
    if ((state == HAL_USART_STATE_BUSY_TX) || (state == HAL_USART_STATE_BUSY_TX_RX)) {
        for (nb_tx_data = handle->txProcessData; nb_tx_data > 0U; nb_tx_data--) {
            if (handle->txCount == 0U) {
                /* Disable the TX FIFO threshold interrupt */
                usart_disable_interrupt(handle, USART_IT_TXFT);

                /* Enable the USART Transmit Complete Interrupt */
                usart_enable_interrupt(handle, USART_IT_TC);

                break; /* force exit loop */
            } else if (((handle->Instance->ISR & (USART_FLAG_TXFNF)) == USART_FLAG_TXFNF) == SET) {
                handle->Instance->TDR = (uint8_t) (*handle->txPointer & (uint8_t) 0xFF);
                handle->txPointer++;
                handle->txCount--;
            } else {
                /* Nothing to do */
            }
        }
    }
}

void usart_enable_interrupt(USART_Handle *handle, uint32_t interrupt)
{
    // Extract which control register (CR1=1, CR2=2, CR3=3)
    uint32_t cr_number = (interrupt & USART_CR_MASK) >> USART_CR_POS;

    // Extract the bit position within that register
    uint32_t bit_position = interrupt & USART_IT_MASK;

    // Set the bit in the appropriate control register
    if (cr_number == 1) {
        handle->Instance->CR1 |= (1UL << bit_position);
    } else if (cr_number == 2) {
        handle->Instance->CR2 |= (1UL << bit_position);
    } else {
        handle->Instance->CR3 |= (1UL << bit_position);
    }
}

void usart_disable_interrupt(USART_Handle *handle, uint32_t interrupt)
{
    // Extract which control register (CR1=1, CR2=2, CR3=3)
    uint32_t cr_number = (interrupt & USART_CR_MASK) >> USART_CR_POS;

    // Extract the bit position within that register
    uint32_t bit_position = interrupt & USART_IT_MASK;

    // Clear the bit in the appropriate control register
    if (cr_number == 1) {
        handle->Instance->CR1 &= ~(1UL << bit_position);
    } else if (cr_number == 2) {
        handle->Instance->CR2 &= ~(1UL << bit_position);
    } else {
        handle->Instance->CR3 &= ~(1UL << bit_position);
    }
}

static HAL_Status usart_check_flag(USART_Handle *handle, USART_Flag flag, FlagStatus status, uint32_t tickstart, uint32_t timeout)
{
    /* Wait until flag is set */
    while ((((handle->Instance->ISR & flag) == flag) ? SET : RESET) != status) {
        /* Check for the Timeout */
        if (((HAL_GetTick() - tickstart) > timeout) || (timeout == 0U)) {
            handle->State = HAL_USART_STATE_READY;
            return HAL_TIMEOUT;
        }
    }
    return HAL_OK;
}

static HAL_Status usart_check_idle(USART_Handle *handle)
{
    uint32_t tickstart;
    handle->errorCode = USART_ERROR_NONE;
    tickstart         = HAL_GetTick();

    if ((handle->Instance->CR1 & USART_CR1_TE) == USART_CR1_TE) {
        /* Wait until TEACK flag is set */
        if (usart_check_flag(handle, USART_FLAG_TEACK, SET, tickstart, USART_TX_RX_TIMEOUT) != HAL_OK) {
            return HAL_TIMEOUT;
        }
    }

    if ((handle->Instance->CR1 & USART_CR1_RE) == USART_CR1_RE) {
        /* Wait until REACK flag is set */
        if (usart_check_flag(handle, USART_FLAG_REACK, SET, tickstart, USART_TX_RX_TIMEOUT) != HAL_OK) {
            return HAL_TIMEOUT;
        }
    }

    handle->State = HAL_USART_STATE_READY;
    return HAL_OK;
}

static HAL_Status usart_set_config(USART_Handle *handle)
{
    HAL_Status ret = HAL_OK;

    // USART CR1 CONFIGURATION
    // uint32_t cr1_config = (uint32_t) handle->Init.WordLen | handle->Init.Parity | handle->Init.Mode | USART_CR1_OVER8;
    uint32_t cr1_config = (uint32_t) handle->Init.WordLen | handle->Init.Parity | handle->Init.Mode;
    MODIFY_REG(handle->Instance->CR1, USART_CR1_CLEARMASK, cr1_config);

    // USART CR2 CONFIGURATION
    // Fixed for async UART:
    uint32_t cr2_config = (uint32_t) handle->Init.StopBits;
    // uint32_t cr2_config = (uint32_t) USART_CR2_CLKEN;
    // cr2_config |= handle->Init.CLKLastBit | handle->Init.CLKPolarity | handle->Init.CLKPhase | handle->Init.StopBits;
    MODIFY_REG(handle->Instance->CR2, USART_CR2_CLEARMASK, cr2_config);

    // USART PRESCALER CONFIGURATION
    MODIFY_REG(handle->Instance->PRESC, USART_PRESC_PRESCALER, handle->Init.ClockPrescaler);

    // USART BRR (baudrate)
    ret = usart_set_baudrate(handle->Instance, handle->Init.BaudRate);

    handle->TxISR = NULL;
    handle->RxISR = NULL;

    return ret;
}

static inline uint32_t usart_get_clock_source(USART_TypeDef *USARTx)
{
    if (USARTx == USART1) {
        return (RCC->CCIPR2 >> 0) & 0x7;
    } else if (USARTx == USART2) {
        return (RCC->CCIPR2 >> 3) & 0x7;
    } else if (USARTx == USART3) {
        return (RCC->CCIPR2 >> 6) & 0x7;
    }

    return USART_CLOCKSOURCE_UNDEFINED;
}

static uint32_t usart_get_clock_freq(USART_ClockSource clock_source)
{
    switch (clock_source) {
    case USART_CLOCKSOURCE_PCLK1:
        return HAL_RCC_GetPCLK1Freq();
    case USART_CLOCKSOURCE_PCLK2:
        return HAL_RCC_GetPCLK2Freq();
    case USART_CLOCKSOURCE_HSI: {
        // // Check if HSI divider is enabled (bit in RCC_CR)
        // if (RCC->CR & RCC_CR_HSIDIV) {
        //     uint32_t divider = (RCC->CR & RCC_CR_HSIDIV_Msk) >> RCC_CR_HSIDIV_Pos;
        //     return HSI_VALUE >> divider;
        // }
        // return HSI_VALUE;
        uint32_t hsi_freq = HSI_VALUE; // Start with 64 MHz

        // Check if HSIDIV is enabled AND get divider value
        if (RCC->CR & RCC_CR_HSIDIVF) {
            // Get divider value from bits [4:3]
            uint32_t hsidiv = (RCC->CR >> 3) & 0x3;

            // 00 = /1, 01 = /2, 10 = /4, 11 = /8
            const uint8_t div_table[4] = {1, 2, 4, 8};
            hsi_freq /= div_table[hsidiv];
        }

        return hsi_freq;
    }
    case USART_CLOCKSOURCE_CSI:
        return CSI_VALUE; // 4 MHz typically
    default:
        return 0;
    }
}

static HAL_Status usart_set_baudrate(USART_TypeDef *USARTx, uint32_t BaudRate)
{
    uint32_t clock_source = usart_get_clock_source(USARTx);

    uint32_t clock_freq = usart_get_clock_freq(clock_source);

    if (clock_freq == 0) {
        return HAL_ERROR;
    }

    USARTx->BRR = ((clock_freq + (BaudRate / 2U)) / BaudRate);

    return HAL_OK;
}
